In [19]:
import pandas as pd

In [20]:
x = [1.0,2.0,3.0,4.0,5.0]
y = [2.0,1.0,9.0,8.0,6.0]
df = pd.DataFrame({"x": x, "y": y})

In [21]:
df.to_json("mydata.json", orient="records")

In [22]:
df2 = pd.read_json("https://data.nasa.gov/resource/2vr3-k9wn.json")

In [23]:
df2.describe()

,h_mag,moid_au,q_au_1,q_au_2,period_yr,i_deg
count,181.000000,202.000000,202.000000,200.000000,2.000000e+02,202.000000
mean,20.310497,0.330541,1.063515,235.349500,1.072373e+04,29.382772
std,1.521932,0.723355,0.743516,2040.071002,1.033174e+05,27.307793
min,15.600000,0.000200,0.140000,1.040000,7.200000e-01,0.820000
25%,19.400000,0.054500,0.772500,2.092500,1.855000e+00,14.082500
50%,20.300000,0.149000,0.970000,3.470000,3.250000e+00,22.945000
75%,21.300000,0.268750,1.110000,4.560000,4.390000e+00,34.202500
max,24.300000,6.373000,7.150000,23255.110000,1.254180e+06,162.300000

In [24]:
df2.to_json("neo_objects.json", orient="records")

In [25]:
df2

,designation,discovery_date,h_mag,moid_au,q_au_1,q_au_2,period_yr,i_deg,pha,orbit_class
0,419880 (2011 AH37),2011-01-07T00:00:00.000,19.7,0.035,0.84,4.26,4.06,9.65,Y,Apollo
1,419624 (2010 SO16),2010-09-17T00:00:00.000,20.5,0.028,0.93,1.08,1.00,14.52,Y,Apollo
2,414772 (2010 OC103),2010-07-28T00:00:00.000,19.0,0.333,0.39,2.00,1.31,23.11,N,Apollo
3,414746 (2010 EH20),2010-03-06T00:00:00.000,18.0,0.268,1.25,3.99,4.24,23.89,N,Amor
4,407324 (2010 OB101),2010-07-18T00:00:00.000,20.7,0.111,0.77,2.46,2.06,9.12,N,Apollo
...,...,...,...,...,...,...,...,...,...,...
197,(2010 CO1),2010-02-01T00:00:00.000,21.5,0.023,0.79,1.23,1.02,24.03,Y,Apollo
198,P/2010 B2 (WISE),2010-01-22T00:00:00.000,NaN,0.630,1.62,4.60,5.49,8.93,n/a,Encke-type Comet
199,(2010 AU118),2010-01-13T00:00:00.000,17.7,0.147,1.13,2.12,2.06,43.73,N,Amor
200,(2010 AG79),2010-01-13T00:00:00.000,19.9,0.244,1.22,4.59,4.95,32.96,N,Amor
201,(2010 AB78),2010-01-12T00:00:00.000,18.3,0.206,1.02,3.49,3.38,33.26,N,Amor